GitMorRic/KneeExo/sdkconfig.defaults
# ---- Target ---------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash / PSRAM (ESP32-S3-N16R8 = 16MB Flash / 8MB Octal PSRAM) ---------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# ---- Partitions -----------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# ---- FreeRTOS -------------------------------------------------------------
# 1kHz tick 方便 10ms 控制周期与 vTaskDelayUntil
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ---- Main task ------------------------------------------------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ---- C++ ------------------------------------------------------------------
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# ---- Log ------------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=y

# ---- Watchdog -------------------------------------------------------------
# 打开 Task WDT，但允许闲时 idle
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
